       IDENTIFICATION DIVISION.
       PROGRAM-ID. REAJUSTE.
       AUTHOR. CAIO SOUZA SILVA
       DATE-WRITTEN. 30/03/22 
       DATA DIVISION.   
       WORKING-STORAGE SECTION.
       77  SALARIO        PIC 9(4)V99. 
       77  POR-REAJUSTE   PIC 9V99.
       77  RESULT         PIC 9(4)V99.
       PROCEDURE DIVISION.
           DISPLAY "DIGITE O SALARIO: "
           ACCEPT SALARIO
           DISPLAY "DIGITE O PERCENTUAL DE REAJUSTE "
           ACCEPT POR-REAJUSTE 
           MULTIPLY SALARIO BY POR-REAJUSTE GIVING RESULT
           ADD RESULT TO SALARIO GIVING RESULT
           DISPLAY "O SALARIO AJUSTADO E: " RESULT
           STOP RUN.      
