       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HELLO.
       AUTHOR. CAIO SOUZA SILVA
       DATE-WRITTEN. 30/03/22
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "Olá Mundo!"
           STOP RUN. 